spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3StatusGateway/when_requesting_status_for_invoice/returns_a_decent_response_for_a_successful_credit_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=InvoiceInfo
    body:
      encoding: ASCII-8BIT
      string: brq_invoicenumber=2013-0001&brq_websitekey=<WEBSITEKEY>&brq_signature=4759bd83091714905a6d8856b6f6ce67c70905b6
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 11:48:25 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '16763'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d3ce53b11a39f479d7aaaa1eb44a0d3151597837704; expires=Fri, 18-Sep-20
        11:48:24 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a825961500000c85819e1200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c53a5368e580c85-AMS
    body:
      encoding: ASCII-8BIT
      string: BRQ_APIRESULT=Success&BRQ_INVOICE_1_CREDITMANAGEMENT=False&BRQ_INVOICE_1_NUMBER=2013-0001&BRQ_INVOICE_1_TEST=False&BRQ_INVOICE_1_TRANSACTIONS_1_AMOUNTDEBIT=10&BRQ_INVOICE_1_TRANSACTIONS_1_AMOUNTREFUNDABLE=10&BRQ_INVOICE_1_TRANSACTIONS_1_CREATEDDATETIME=2013-07-16+05%3a55%3a49&BRQ_INVOICE_1_TRANSACTIONS_1_CURRENCY=EUR&BRQ_INVOICE_1_TRANSACTIONS_1_DESCRIPTION=MoneyBird+creditcard+validation&BRQ_INVOICE_1_TRANSACTIONS_1_ID=AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA&BRQ_INVOICE_1_TRANSACTIONS_1_STATUS_CODE=190&BRQ_INVOICE_1_TRANSACTIONS_1_STATUS_DATETIME=2013-07-16+05%3a57%3a01&BRQ_INVOICE_1_TRANSACTIONS_1_STATUS_MESSAGE=Success&BRQ_INVOICE_1_TRANSACTIONS_1_STATUS_SUCCESS=True&BRQ_INVOICE_1_TRANSACTIONS_1_TEST=False&BRQ_INVOICE_1_TRANSACTIONS_1_TYPE=V044&BRQ_INVOICE_1_TRANSACTIONS_1_TYPEDESCRIPTION=Creditcard+-+Visa+via+EMS&BRQ_SIGNATURE=3537e255d785cb0666b56eef59c8d3e6baa91ce9
  recorded_at: Wed, 19 Aug 2020 11:48:25 GMT
recorded_with: VCR 6.0.0
